app/views/orders/show.html.erb

SELECT "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 2]]
SELECT COUNT(*) FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 2]]
---
      <th>Items:</th>
      <td><%= @order.order_items.count %></td>

SELECT "addresses".* FROM "addresses"  WHERE "addresses"."user_id" = ?  [["user_id", 2]]
---
        <% if current_user %>
          <%= f.select :address_id, current_user.addresses.collect { |a| [a.to_s, a.id] } %>