app/controllers/addresses_controller.rb

  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save
        format.html { redirect_to order_path(current_user.orders.first), notice: 'Address was successfully created.' }
---
INSERT INTO "addresses" ("city", "created_at", "line1", "line2", "state", "updated_at", "user_id", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "orders".* FROM "orders"  WHERE "orders"."user_id" = ?  ORDER BY "orders"."id" ASC LIMIT 1  [["user_id", 2]]

  def destroy
    @address.destroy
---
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 3]]