app/controllers/orders_controller.rb

UPDATE "orders" SET "address_id" = ?, "status" = ?, "updated_at" = ? WHERE "orders"."id" = 5  [["address_id", 1], ["status", "submitted"], ["updated_at", "2014-08-17 14:27:37.149156"]]
---
  def update
    respond_to do |format|
      if @order.update(order_params.merge(status: "submitted"))