app/controllers/order_items_controller.rb

  def create
    @order_item = @order.order_items.find_or_initialize_by(product_id: params[:product_id])
    @order_item.quantity += 1

    respond_to do |format|
      if @order_item.save
---
UPDATE "order_items" SET "quantity" = ?, "updated_at" = ? WHERE "order_items"."id" = 14  [["quantity", 2], ["updated_at", "2014-08-16 21:30:49.858925"]]

  def update
    @order_item = OrderItem.find(params[:id])

    respond_to do |format|
      if params[:order_item][:quantity].to_i == 0
        @order_item.destroy
        format.html { redirect_to order_path(@order_item.order), notice: 'The item was removed.' }
---
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 20]]
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 2]]