app/controllers/order_items_controller.rb

  def index
    @order_items = OrderItem.all
---
SELECT "order_items".* FROM "order_items"

  def create
    @order_item = @order.order_items.new(quantity: 1, product_id: params[:product_id])

    respond_to do |format|
      if @order_item.save
---
SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ? AND "order_items"."product_id" = 1 LIMIT 1  [["order_id", 2]]
INSERT INTO "order_items" ("created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-08-16 15:36:22.776643"], ["order_id", 2], ["product_id", 1], ["quantity", 1], ["updated_at", "2014-08-16 15:36:22.776643"]]
INSERT INTO "orders" ("created_at", "id", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-08-17 01:22:33.721052"], ["id", 5], ["status", "unsubmitted"], ["updated_at", "2014-08-17 01:22:33.721052"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @order_item.update(order_item_params)
---
UPDATE "order_items" SET "quantity" = ?, "updated_at" = ? WHERE "order_items"."id" = 14  [["quantity", 3], ["updated_at", "2014-08-16 21:35:54.161620"]]

  def destroy
    @order_item.destroy
    respond_to do |format|
      format.html { redirect_to order_path(@order_item.order), notice: 'Order item was successfully destroyed.' }
---
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 7]]
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 2]]

    def set_order_item
      @order_item = OrderItem.find(params[:id])
---
SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."id" = ? LIMIT 1  [["id", 14]]

    def load_order
      @order = Order.find_or_initialize_by(id: session[:order_id], status: "unsubmitted")
---
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = 2 AND "orders"."status" = 'unsubmitted' LIMIT 1