app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-08-16 22:24:16.626522"], ["name", "Cullen"], ["provider", "twitter"], ["uid", "2299909334"], ["updated_at", "2014-08-16 22:24:16.626522"]]
UPDATE "orders" SET "updated_at" = ?, "user_id" = ? WHERE "orders"."id" = 4  [["updated_at", "2014-08-16 23:06:08.467578"], ["user_id", 2]]
---
  def create
    @user = User.find_or_create_by_auth(request.env["omniauth.auth"])
    session[:user_id] = @user.id
    load_order
    @order.update_attributes(user: @user)